//每个区由若干个内存块组成

//每个区由若干个内存块组成，//每个块是4096个字节

//int i = 0;*/

//*//*int i = 0;

// /**/int i = 0;

/* int i = 0;
 *//*
 */

/* int i = 0;
//*/int j = 0;

/*
//每个区由若干个内存块组成，每个块是4096个字节
//每个块的第0个整数指向下个区
//所以是单链表结构
//所以每个区只有4092个字节存放真正的数据
*/

/* int i = 0;*//*int j = 0;
 */

/*
 *//*
 */int i =0;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////     5

"abcdefghijklmn~~~~!!!!!!!!"
/******************************************************************/


#include<iostream>

using namespace std;

int main()
{
     ////////////////////////////////////////
     // b = 3/2*3  "注释转换"               //
     /*     cpp//------->c""    */
    /***************/
    /***************/
    /*   9/3 = 3 */
    int i=2;
    int j = 2;
    //"liubaobao"
    printf("%d", i/j/7*32);
    printf("//注释转换//");
    /////c=(i+j)/2/3*6*6/////

     return 0;
}
nfdfgnf//fmkgfgfffg
fdnfmdn/*fkdfndk*/fmdkf
//fjrdgjfk//ndjfjd
//njdkfjn/*nmfdfnd
//jkjksdkjfkg
/*jhjkkkhjlkl
 *
 *fkdlfjklgjfdlk
 *mfkmgkfg
 *
 *
 ******************************
 *bghjkgjkfgkjgjk
 *
 *
 *
 */


//char str = "dnkfhdkjrejlkf//mfdkjkie/*bfdjfdfh";
//每个区由若干个内存块组成

//每个区由若干个内存块组成，//每个块是4096个字节

//int i = 0;*/              

//*//*int i = 0;            

// /**/int i = 0;           

/* int i = 0;               
 *//*
 */

/* int i = 0;
//*/int j = 0;              

/*
//每个区由若干个内存块组成，每个块是4096个字节
//每个块的第0个整数指向下个区
//所以是单链表结构
//所以每个区只有4092个字节存放真正的数据                
*/

/* int i = 0;*//*int j = 0;               
 */

/*
 *//*
 */int i =0;                             

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////     5

"abcdefghijklmn~~~~!!!!!!!!"

//char *str = "fdnjfhrkjr.//fdnjkhd*/nfjdnj";

/*hdgkhf**/
